STMicroelectronics/STM32DDRFW-UTIL/Drivers/BSP/STM32MP235F-DK/stm32mp235f_disco.h
#define COM_CA35_TX_AF                      UTIL_UART_TX_AF

#if (UTIL_UART_RX_PIN == UTIL_PIN0)
#define COM_CA35_RX_PIN                     GPIO_PIN_0
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(0)
#elif (UTIL_UART_RX_PIN == UTIL_PIN1)
#define COM_CA35_RX_PIN                     GPIO_PIN_1
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(1)
#elif (UTIL_UART_RX_PIN == UTIL_PIN2)
#define COM_CA35_RX_PIN                     GPIO_PIN_2
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(2)
#elif (UTIL_UART_RX_PIN == UTIL_PIN3)
#define COM_CA35_RX_PIN                     GPIO_PIN_3
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(3)
#elif (UTIL_UART_RX_PIN == UTIL_PIN4)
#define COM_CA35_RX_PIN                     GPIO_PIN_4
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(4)
#elif (UTIL_UART_RX_PIN == UTIL_PIN5)
#define COM_CA35_RX_PIN                     GPIO_PIN_5
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(5)
#elif (UTIL_UART_RX_PIN == UTIL_PIN6)
#define COM_CA35_RX_PIN                     GPIO_PIN_6
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(6)
#elif (UTIL_UART_RX_PIN == UTIL_PIN7)
#define COM_CA35_RX_PIN                     GPIO_PIN_7
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(7)
#elif (UTIL_UART_RX_PIN == UTIL_PIN8)
#define COM_CA35_RX_PIN                     GPIO_PIN_8
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(8)
#elif (UTIL_UART_RX_PIN == UTIL_PIN9)
#define COM_CA35_RX_PIN                     GPIO_PIN_9
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(9)
#elif (UTIL_UART_RX_PIN == UTIL_PIN10)
#define COM_CA35_RX_PIN                     GPIO_PIN_10
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(10)
#elif (UTIL_UART_RX_PIN == UTIL_PIN11)
#define COM_CA35_RX_PIN                     GPIO_PIN_11
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(11)
#elif (UTIL_UART_RX_PIN == UTIL_PIN12)
#define COM_CA35_RX_PIN                     GPIO_PIN_12
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(12)
#elif (UTIL_UART_RX_PIN == UTIL_PIN13)
#define COM_CA35_RX_PIN                     GPIO_PIN_13
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(13)
#elif (UTIL_UART_RX_PIN == UTIL_PIN14)
#define COM_CA35_RX_PIN                     GPIO_PIN_14
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(14)
#elif (UTIL_UART_RX_PIN == UTIL_PIN15)
#define COM_CA35_RX_PIN                     GPIO_PIN_15
#define COM_CA35_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(15)
#else
  #error "unknown UTIL_UART_RX_PIN definition."
#endif

#if (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOA)
  #define COM_CA35_RX_GPIO_PORT             GPIOA
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOA_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(90)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOB)
  #define COM_CA35_RX_GPIO_PORT             GPIOB
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOB_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(91)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOC)
  #define COM_CA35_RX_GPIO_PORT             GPIOC
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOC_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(92)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOD)
  #define COM_CA35_RX_GPIO_PORT             GPIOD
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOD_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(93)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOE)
  #define COM_CA35_RX_GPIO_PORT             GPIOE
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOE_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(94)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOF)
  #define COM_CA35_RX_GPIO_PORT             GPIOF
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOF_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOF_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(95)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOG)
  #define COM_CA35_RX_GPIO_PORT             GPIOG
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOG_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOG_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(96)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOH)
  #define COM_CA35_RX_GPIO_PORT             GPIOH
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOH_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOH_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(97)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOI)
  #define COM_CA35_RX_GPIO_PORT             GPIOI
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOI_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOI_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(98)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOJ)
  #define COM_CA35_RX_GPIO_PORT             GPIOJ
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOJ_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOJ_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(99)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOK)
  #define COM_CA35_RX_GPIO_PORT             GPIOK
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOK_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOK_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(100)
#elif (UTIL_UART_RX_GPIO_PORT == UTIL_GPIOZ)
  #define COM_CA35_RX_GPIO_PORT             GPIOZ
  #define COM_CA35_RX_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOZ_CLK_ENABLE()
  #define COM_CA35_RX_GPIO_CLK_DISABLE()    __HAL_RCC_GPIOZ_CLK_DISABLE()
  #define COM_CA35_RIF_RES_TYP_RX_PIN       RESMGR_RESOURCE_RIF_GPIOA
  #define COM_CA35_RCC_RES_RX_PIN           RESMGR_RCC_RESOURCE(101)
#else
  #error "unknown UTIL_UART_RX_GPIO_PORT definition."
#endif

#define COM_CA35_RX_AF                      UTIL_UART_RX_AF

/*********************** COM_CM33 ******************************/
#define COM_CM33_UART                       UART5 /* VALID1/3 */
#define COM_CM33_CLK_ENABLE()               __HAL_RCC_UART5_CLK_ENABLE()
#define COM_CM33_CLK_DISABLE()              __HAL_RCC_UART5_CLK_DISABLE()

#define COM_CM33_TX_PIN                     GPIO_PIN_9
#define COM_CM33_TX_GPIO_PORT               GPIOG
#define COM_CM33_TX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_CM33_TX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOG_CLK_DISABLE()
#define COM_CM33_TX_AF                      GPIO_AF5_UART5

#define COM_CM33_RX_PIN                     GPIO_PIN_10
#define COM_CM33_RX_GPIO_PORT               GPIOG
#define COM_CM33_RX_GPIO_CLK_ENABLE()       __HAL_RCC_GPIOG_CLK_ENABLE()
#define COM_CM33_RX_GPIO_CLK_DISABLE()      __HAL_RCC_GPIOG_CLK_DISABLE()
#define COM_CM33_RX_AF                      GPIO_AF5_UART5


#define COM_CM33_RIF_RES_TYP_UART           RESMGR_RESOURCE_RIFSC
#define COM_CM33_RIF_RES_NUM_UART           RESMGR_RIFSC_UART5_ID

#define COM_CM33_RIF_RES_TYP_TX_PIN         RESMGR_RESOURCE_RIF_GPIOG
#define COM_CM33_RIF_RES_NUM_TX_PIN         RESMGR_GPIO_PIN(9)

#define COM_CM33_RIF_RES_TYP_RX_PIN         RESMGR_RESOURCE_RIF_GPIOG
#define COM_CM33_RIF_RES_NUM_RX_PIN         RESMGR_GPIO_PIN(10)

#define COM_CM33_TX_GPIO_IS_CLK_ENABLED()   __HAL_RCC_GPIOG_IS_CLK_ENABLED()
#define COM_CM33_RX_GPIO_IS_CLK_ENABLED()   __HAL_RCC_GPIOG_IS_CLK_ENABLED()


#endif /* CORE_CA35 || CORE_CM33 */

/*********************** COM_CM0PLUS ******************************/
#define COM_CM0PLUS_UART                    LPUART1
#define COM_CM0PLUS_CLK_ENABLE()            __HAL_RCC_LPUART1_CLK_ENABLE()
#define COM_CM0PLUS_CLK_DISABLE()           __HAL_RCC_LPUART1_CLK_DISABLE()

